NordicSemiconductor/nrfx/mdk/nrf54lm20a_enga_flpr.svd
          <register>
            <name>CORRTESTCUTOFF1</name>
            <description>CorrTestCutoff register 1</description>
            <addressOffset>0x06C</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DLYTWOCUTOFF</name>
                <description>Correlation test cut-off value for delay of +/- 2 samples.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>DLYTHREECUTOFF</name>
                <description>Correlation test cut-off value for delay of +/- 3 samples.</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCORRTESTFAILED</name>
            <description>Auto-correlation test failing ring(s).</description>
            <addressOffset>0x070</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AUTOCORRTESTFAILED</name>
                <description>Auto-correlation test failing ring(s).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CORRTESTFAILED</name>
            <description>Correlation test failing ring.</description>
            <addressOffset>0x074</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CORRTESTFAILED</name>
                <description>Correlation test failing ring.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HWVERSION</name>
            <description>Fixed to 1 for this version.</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HWVERSION</name>
                <description>Fixed to 1 for this version.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PK</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_PK</headerStructName>
          <access>read-write</access>
          <addressOffset>0x2000</addressOffset>
          <register>
            <name>POINTERS</name>
            <description>Pointers register.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OPPTRA</name>
                <description>When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF).</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>OPPTRB</name>
                <description>When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF).</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>OPPTRC</name>
                <description>When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>OPPTRN</name>
                <description>When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF).</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COMMAND</name>
            <description>Command register.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OPEADDR</name>
                <description>This field defines the operation to be performed.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FIELDF</name>
                <description>0: Field is GF(p) 1: Field is GF(2**m)</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OPBYTESM1</name>
                <description>This field defines the size (= number of bytes minus one) of the operands for the current operation.</description>
                <lsb>8</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>RANDMOD</name>
                <description>Enable randomization of modulus (counter-measure).</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>SELCURVE</name>
                <description>Enable accelerator for specific curve modulus:</description>
                <lsb>20</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOACCEL</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P256</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P384</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P521</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P192</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CURVE25519</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ED25519</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RANDKE</name>
                <description>Enable randomization of exponent/scalar (counter-measure).</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>RANDPROJ</name>
                <description>Enable randomization of projective coordinates (counter-measure).</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>EDWARDS</name>
                <description>Enable Edwards curve.</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>SWAPBYTES</name>
                <description>Swap the bytes on AHB interface:</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NATIVE</name>
                    <description>Native format (little endian).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SWAPPED</name>
                    <description>Byte swapped (big endian).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FLAGA</name>
                <description>Flag A.</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FLAGB</name>
                <description>Flag B.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>CALCR2</name>
                <description>This bit indicates if the IP has to calculate R**2 mod N for the next operation.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NRECALCULATE</name>
                    <description>don't recalculate R² mod N</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RECALCULATE</name>
                    <description>re-calculate R² mod N</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL</name>
            <description>Command register.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>START</name>
                <description>Writing a 1 starts the processing.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>CLEARIRQ</name>
                <description>Writing a 1 clears the IRQ output.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status register.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORFLAGS</name>
                <description>These bits indicate an error condition.</description>
                <lsb>4</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PKBUSY</name>
                <description>This bit reflects the BUSY output value.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>INTRPTSTATUS</name>
                <description>This bit reflects the IRQ output value.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FAILPTR</name>
                <description>These bits indicate which data location generated the error flag.</description>
                <lsb>24</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMER</name>
            <description>Timer register.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMER</name>
                <description>Number of clock cycles (as the number of core cycles is always even, register bit 0 is tied to zero.</description>
                <lsb>1</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWCONFIG</name>
            <description>Hardware configuration register.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x01F30000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXOPSIZE</name>
                <description>Maximum operand size (number of bytes).</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>NBMULT</name>
                <description>Number of multipliers:</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MULT1</name>
                    <description>1 multiplier</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MULT4</name>
                    <description>4 multipliers</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MULT16</name>
                    <description>16 multipliers</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MULT64</name>
                    <description>64 multipliers</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MULT256</name>
                    <description>256 multipliers</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRIMEFIELD</name>
                <description>Support prime field.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BINARYFIELD</name>
                <description>Support binary field.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DATAMEMECC</name>
                <description>Support data memory error correction.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CODEMEMECC</name>
                <description>Support code memory error correction.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>P256</name>
                <description>Support ECC P256 acceleration.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>P384</name>
                <description>Support ECC P384 acceleration.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>P521</name>
                <description>Support ECC P521 acceleration.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>P192</name>
                <description>Support ECC P192 acceleration.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>X25519</name>
                <description>Support Curve25519/Ed25519 acceleration.</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>AHBMASTER</name>
                <description>Memory access</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SLAVE</name>
                    <description>Memory access through AHB Slave and internally in the PKE.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MASTER</name>
                    <description>Memory access through AHB Master, outside the PKE.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CODERAM</name>
                <description>Code memory</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ROM</name>
                    <description>Code memory is a ROM.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAM</name>
                    <description>Code memory is a RAM.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLESMX</name>
                <description>State of DisableSMx input (high when SM2/SM9 operations are disabled).</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DISABLECLRMEM</name>
                <description>State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled).</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DISABLECM</name>
                <description>State of DisableCM input (high when counter-measures are disabled).</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OPSIZE</name>
            <description>Operand size register.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00001000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OPSIZE</name>
                <description>Operand size (number of bytes): 
					This register is used when the memory is accessed via AHB Master</description>
                <lsb>0</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPSIZE256</name>
                    <description>256 bytes.</description>
                    <value>0x0100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPSIZE521</name>
                    <description>521 bytes.</description>
                    <value>0x0209</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPSIZE2048</name>
                    <description>2048 bytes.</description>
                    <value>0x0800</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPSIZE4096</name>
                    <description>4096 bytes.</description>
                    <value>0x1000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ECCERRORBITPOS</name>
            <description>ECC Error bit position register.</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x03FF03FF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORBITPOS1</name>
                <description>Position of error bit 1</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRORBITPOS2</name>
                <description>Position of error bit 2</description>
                <lsb>16</lsb>
                <msb>25</msb>
              </field>
            </fields>
          </register>
