NordicSemiconductor/nrfx/mdk/nrf54lm20a_enga_flpr.svd
          <register>
            <name>ECCCONTROLSTATUSREG</name>
            <description>ECC Control and Status register.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATAMEMCORRECTION</name>
                <description>Data Memory Correction flag, clear on write</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>DATAMEMFAILURE</name>
                <description>Data Memory Failure flag, clear on write</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>CODEMEMCORRECTION</name>
                <description>Code Memory Correction flag, clear on write</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>CODEMEMFAILURE</name>
                <description>Code Memory Failure flag, clear on write</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MICROCODEFORMAT</name>
            <description>Microcode Format register.</description>
            <addressOffset>0x078</addressOffset>
            <access>read-write</access>
            <resetValue>0xD4B79DDA</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MICROCODEFORMAT</name>
                <description>Microcode format number.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HWVERSION</name>
            <description>Hardware Version register.</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00010001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MINOR</name>
                <description>Minor version number.</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MAJOR</name>
                <description>Major version number.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>IKG</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_IKG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x3000</addressOffset>
          <register>
            <name>START</name>
            <description>Start register.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>START</name>
                <description>Start the Isolated Key Generation.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status register.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SEEDERROR</name>
                <description>Seed Error during Isolated Key Generation.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ENTROPYERROR</name>
                <description>Entropy Error during Isolated Key Generation.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>OKAY</name>
                <description>Isolated Key Generation is okay.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CTRDRBGBUSY</name>
                <description>CTR_DRBG health test is busy (only when g_hw_health_test = true).</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CATASTROPHICERROR</name>
                <description>Catastrophic error during CTR_DRBG health test (only when g_hw_health_test = true).</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SYMKEYSTORED</name>
                <description>Symmetric Keys are stored.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PRIVKEYSTORED</name>
                <description>Private Keys are stored.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INITDATA</name>
            <description>InitData register.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INITDATA</name>
                <description>Writing a 1 initialise Nonce and Personalisation_String registers counters, i.e. start writing from the 32 LSB.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCE</name>
            <description>Nonce register.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NONCE</name>
                <description>Nonce (write/read value 32-bit by 32-bit).</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PERSONALISATIONSTRING</name>
            <description>Personalisation String register.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PERSONALISATIONSTRING</name>
                <description>Personalisation String (write/read value 32-bit by 32-bit).</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESEEDINTERVALLSB</name>
            <description>Reseed Interval LSB register.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x80000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESEEDINTERVALLSB</name>
                <description>Reseed Interval LSB.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RESEEDINTERVALMSB</name>
            <description>Reseed Interval MSB register.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESEEDINTERVALMSB</name>
                <description>Reseed Interval MSB.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PKECONTROL</name>
            <description>PKE Control register.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PKESTART</name>
                <description>Start the PKE operation or trigger for Secure mode exit.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>CLEARIRQ</name>
                <description>Clear the IRQ output.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PKECOMMAND</name>
            <description>PKE Command register.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SECUREMODE</name>
                <description>Secure mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DEACTIVATED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVATED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SELECTEDKEY</name>
                <description>Select Generated Private Key for PKE operation.</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OPSEL</name>
                <description>Select PKE operation with Isolated Key</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PUBKEY</name>
                    <description>Public Key Generation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ECDSA</name>
                    <description>ECDSA Signature</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PTMUL</name>
                    <description>Point Multiplication</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PKESTATUS</name>
            <description>PKE Status register.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERROR</name>
                <description>Error because either Private Keys are not stored or the operation is not defined.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STARTERROR</name>
                <description>Error because a new operation is started while the previous one is still busy.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IKGPKBUSY</name>
                <description>Busy, set when the operation starts and cleared when the operation is finished.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IRQSTATUS</name>
                <description>IRQ, set when the operation is finished and cleared when the CPU writes the bit 1 of PKE_Control Register or a new operation is started.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERASEBUSY</name>
                <description>The PKE Data RAM is being erased.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SOFTRST</name>
            <description>SoftRst register.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SOFTRST</name>
                <description>Software reset:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Normal mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>KEY</name>
                    <description>The Isolated Key Generation logic and the keys are reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>HWCONFIG</name>
            <description>HwConfig register.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0xCC4C8312</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NBSYMKEYS</name>
                <description>Number of Symmetric Keys generated.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>NBPRIVKEYS</name>
                <description>Number of Private Keys generated.</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IKGCM</name>
                <description>Countermeasures for IKG operations are implemented when 1.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>HWHEALTHTEST</name>
                <description>CTR_DRBG health test is implemented when 1.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CURVE</name>
                <description>ECC curve for IKG (input).</description>
                <lsb>10</lsb>
                <msb>11</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>P256</name>
                    <description>P256.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P384</name>
                    <description>P384.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P521</name>
                    <description>P521.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DF</name>
                <description>Derivation function is implemented in the CTR_DRBG when 1.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>KEYSIZE</name>
                <description>AES Key Size support for the AES Core embedded in the CTR_DRBG.</description>
                <lsb>13</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AES128</name>
                    <description>supports AES128</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AES192</name>
                    <description>supports AES192</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AES256</name>
                    <description>supports AES256</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENTROPYINPUTLENGTH</name>
                <description>Value of g_entropy_input_length/32.</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>NONCELENGTH</name>
                <description>Value of g_nonce_length/32.</description>
                <lsb>20</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PERSONALIZATIONSTRINGLENGTH</name>
                <description>Value of g_personalization_string_length/32.</description>
                <lsb>24</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ADDITIONALINPUTLENGTH</name>
                <description>Value of g_additional_input_length/32.</description>
                <lsb>28</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
