NordicSemiconductor/nrfx/mdk/nrf54lm20a_enga_flpr.svd
          <register>
            <name>MODE</name>
            <description>Configure EasyDMA mode</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LPOP</name>
                <description>Enable low-power operation, or use low-latency</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LowLat</name>
                    <description>Low-latency operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LowPower</name>
                    <description>Low-power operation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TERMINATEONBUSERROR</name>
            <description>Terminate the transaction if a BUSERROR event is detected.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUSERRORADDRESS</name>
            <description>Address of transaction that generated the last BUSERROR event.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TDM_NS">
      <name>GLOBAL_TDM_S</name>
      <description>Time division multiplexed audio interface 1</description>
      <baseAddress>0x500E8000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TDM</name>
        <value>232</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM23_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 8</description>
      <baseAddress>0x400ED000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS23_NS</name>
      <description>SPI Slave 8</description>
      <baseAddress>0x400ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM23_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 6</description>
      <baseAddress>0x400ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS23_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 6</description>
      <baseAddress>0x400ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE23_NS</name>
      <description>UART with EasyDMA 8</description>
      <baseAddress>0x400ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM23_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 9</description>
      <baseAddress>0x500ED000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS23_S</name>
      <description>SPI Slave 9</description>
      <baseAddress>0x500ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM23_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 7</description>
      <baseAddress>0x500ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS23_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 7</description>
      <baseAddress>0x500ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE23_S</name>
      <description>UART with EasyDMA 9</description>
      <baseAddress>0x500ED000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM23_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL23</name>
        <value>237</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM24_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 10</description>
      <baseAddress>0x400EE000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
