NordicSemiconductor/nrfx/mdk/nrf54lm20a_enga_flpr.svd
          <cluster>
            <name>ERASEPROTECT</name>
            <description>Device erase protection.</description>
            <headerStructName>TAMPC_PROTECT_ERASEPROTECT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x480</addressOffset>
            <register>
              <name>CTRL</name>
              <description>Control register for erase protection.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Set value of eraseprotect signal.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Low</name>
                      <description>Signal is logic 0.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>High</name>
                      <description>Signal is logic 1.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>writeonce</access>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Lock disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Lock enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRITEPROTECTION</name>
                  <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Read: Write protection is disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Read: Write protection is enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Clear</name>
                      <description>Write: Value to clear write protection.</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>KEY</name>
                  <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>KEY</name>
                      <description>Write key value.</description>
                      <value>0x50FA</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Status register for eraseprotect.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ERROR</name>
                  <description>Error detection status.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoError</name>
                      <description>No error detected.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Error</name>
                      <description>Error detected.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPU00_S">
      <name>GLOBAL_SPU30_S</name>
      <description>System protection unit 3</description>
      <baseAddress>0x50100000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <interrupt>
        <name>SPU30</name>
        <value>256</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC00_NS">
      <name>GLOBAL_DPPIC30_NS</name>
      <description>Distributed programmable peripheral interconnect controller 6</description>
      <baseAddress>0x40102000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC00_NS">
      <name>GLOBAL_DPPIC30_S</name>
      <description>Distributed programmable peripheral interconnect controller 7</description>
      <baseAddress>0x50102000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
    </peripheral>
